#!/usr/bin/env python3
# ^3^ coding=utf8
#
# author: superzyx
# date: 2019/08/19
# usage: re


import re


thou = '170.83.202.200 - - [30/Jun/2019:03:19:51 +0800] "GET / HTTP/1.1" 200 152 "-" "Mozilla/5.0 (Macintosh; Intel Ma'
p = re.findall('^(?:[1-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5]?)\.(?:[0-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5]?)\.(?:[0-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5]?)\.(?:[0-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5]?)', thou)
print(p)
# p = re.compile('^([1-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5])\.(([0-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5])\.){2}([0-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5])')
# ou = p.findall(thou)
# print(ou)

# data = 'What is the difference between python 2.7.13 and python 3.7.3 ?'
#
# operaData = re.findall('python [0-9].[0-9].[0-9]', data)	#输出符合模式的字符串,返回的对象是个列表
# print(operaData)


